Repository: trancuong31/auctionweb
Catalog: backend/app/translations/*/LC_MESSAGES/messages.po
Languages: ko, vi

source: Hello, World!
ko: 안녕하세요, 세상!
vi: Xin chào, Thế giới!

source: Login
ko: 로그인
vi: Đăng nhập

source: Logout
ko: 로그아웃
vi: Đăng xuất

source: Username
ko: 사용자 이름
vi: Tên đăng nhập

source: Password
ko: 비밀번호
vi: Mật khẩu

source: Submit
ko: 제출
vi: Gửi

source: User not found
ko: 사용자를 찾을 수 없습니다
vi: Không tìm thấy người dùng

source: Invalid status value
ko: 유효하지 않은 상태 값입니다
vi: Giá trị trạng thái không hợp lệ

source: You don't have permison create auction!
ko: 경매를 생성할 권한이 없습니다!
vi: Bạn không có quyền tạo phiên đấu giá!

source: Auction title already exists
ko: 동일한 경매 제목이 이미 존재합니다
vi: Tiêu đề phiên đấu giá đã tồn tại

source: No files provided
ko: 파일이 제공되지 않았습니다
vi: Không có tệp nào được cung cấp

source: Invalid file name.
ko: 유효하지 않은 파일 이름입니다.
vi: Tên tệp không hợp lệ.

source: Invalid image file type: {file.filename}
ko: 유효하지 않은 이미지 파일 형식입니다: {file.filename}
vi: Loại tệp hình ảnh không hợp lệ: {file.filename}

source: Image file too large (max 5MB): {file.filename}
ko: 이미지 파일이 너무 큽니다 (최대 5MB): {file.filename}
vi: Tệp hình ảnh quá lớn (tối đa 5MB): {file.filename}

source: Total image URLs length too long (max 500 chars): {image_urls}
ko: 이미지 URL의 전체 길이가 너무 깁니다 (최대 500자): {image_urls}
vi: Tổng độ dài URL hình ảnh quá lớn (tối đa 500 ký tự): {image_urls}

source: Internal server error: {str(e)}
ko: 내부 서버 오류: {str(e)}
vi: Lỗi máy chủ nội bộ: {str(e)}

source: No filename provided
ko: 파일 이름이 제공되지 않았습니다
vi: Không có tên tệp được cung cấp

source: Invalid excel file type
ko: 유효하지 않은 엑셀 파일 형식입니다
vi: Loại tệp excel không hợp lệ

source: Excel file too large (max 10MB)
ko: 엑셀 파일이 너무 큽니다 (최대 10MB)
vi: Tệp excel quá lớn (tối đa 10MB)

source: Auction or file not found
ko: 경매 또는 파일을 찾을 수 없습니다
vi: Không tìm thấy phiên đấu giá hoặc tệp

source: File not found on server
ko: 서버에서 파일을 찾을 수 없습니다
vi: Không tìm thấy tệp trên máy chủ

source: Auction not found
ko: 경매를 찾을 수 없습니다
vi: Không tìm thấy phiên đấu giá

source: 0: ongoing, 1: upcoming, 2: ended
ko: 0: 진행 중, 1: 예정, 2: 종료됨
vi: 0: đang diễn ra, 1: sắp diễn ra, 2: đã kết thúc

source: Tìm kiếm theo title auction
ko: 경매 제목으로 검색
vi: Tìm kiếm theo tiêu đề phiên đấu giá

source: Sắp xếp theo: title, created_at, start_time, end_time
ko: 정렬 기준: 제목, 생성일, 시작 시간, 종료 시간
vi: Sắp xếp theo: tiêu đề, ngày tạo, thời gian bắt đầu, thời gian kết thúc

source: Thứ tự sắp xếp: asc (A-Z), desc (Z-A)
ko: 정렬 순서: asc (오름차순 A‑Z), desc (내림차순 Z‑A)
vi: Thứ tự sắp xếp: tăng dần (A-Z), giảm dần (Z-A)

source: Số trang
ko: 페이지 번호

source: Số item trên mỗi trang
ko: 페이지당 항목 수
vi: Số mục trên mỗi trang

source: Từ ngày
ko: 시작일

source: Đến ngày
ko: 종료일

source: Auction is not active
ko: 경매가 활성 상태가 아닙니다
vi: Phiên đấu giá không hoạt động

source: User not allowed to bid
ko: 입찰할 권한이 없습니다
vi: Bạn không được phép đặt giá

source: Bid amount is invalid. Your bid must be at least {min_bid:,.0f}$ {min_bid_msg}
ko: 잘못된 입찰 금액입니다. 입찰 금액은 최소 {min_bid:,.0f}$이어야 합니다 {min_bid_msg}
vi: Số tiền đặt giá không hợp lệ. Giá của bạn phải ít nhất là {min_bid:,.0f}$ {min_bid_msg}

source: User has already placed a bid for this auction
ko: 사용자가 이 경매에 이미 입찰했습니다
vi: Bạn đã đặt giá cho phiên đấu giá này rồi

source: You have successfully placed a bid of {bid_in.bid_amount:,.0f}$ on auction {auction.title}.
ko: 경매 {auction.title}에 {bid_in.bid_amount:,.0f}$ 입찰이 성공적으로 완료되었습니다.
vi: Bạn đã đặt giá thành công {bid_in.bid_amount:,.0f}$ cho phiên đấu giá {auction.title}.

source: Incorrect email or password
ko: 이메일 또는 비밀번호가 올바르지 않습니다
vi: Email hoặc mật khẩu không đúng

source: User is inactive or banned
ko: 사용자가 비활성 상태이거나 정지되었습니다
vi: Tài khoản bị khóa hoặc chưa kích hoạt

source: Account already registered
ko: 이미 등록된 계정입니다
vi: Tài khoản đã được đăng ký

source: Invalid refresh token
ko: 유효하지 않은 리프레시 토큰입니다
vi: Refresh token không hợp lệ

source: You don't have permison watch users!
ko: 사용자 목록을 볼 권한이 없습니다!
vi: Bạn không có quyền xem danh sách người dùng!

source: Permission denied
ko: 권한이 거부되었습니다
vi: Không có quyền truy cập

source: Status must be 0 (disactive) or 1 (active)
ko: 상태는 0(비활성) 또는 1(활성)이어야 합니다
vi: Trạng thái phải là 0 (không hoạt động) hoặc 1 (hoạt động)

source: User status updated to {data.status}.
ko: 사용자 상태가 {data.status}(으)로 업데이트되었습니다.
vi: Trạng thái người dùng đã được cập nhật thành {data.status}.

source: User updated successfully.
ko: 사용자가 성공적으로 업데이트되었습니다.
vi: Cập nhật người dùng thành công.

source: User deleted successfully.
ko: 사용자가 성공적으로 삭제되었습니다.
vi: Xóa người dùng thành công.

source: You are not allowed to edit this auction
ko: 이 경매를 수정할 권한이 없습니다
vi: Bạn không có quyền chỉnh sửa phiên đấu giá này

source: You are not allowed to edit auctions
ko: 경매를 수정할 권한이 없습니다
vi: Bạn không có quyền chỉnh sửa các phiên đấu giá

source: Your new price must be at least one price step away from your old price.
ko: 새 가격은 이전 가격과 최소 한 단계 이상 차이가 있어야 합니다.
vi: Giá mới của bạn phải cách giá cũ ít nhất một bước giá.

source: Admin cannot modify Super Admin information
ko: 관리자는 슈퍼 관리자 정보를 수정할 수 없습니다
vi: Admin không có quyền chỉnh sửa thông tin của supper Admin

source: Admin cannot delete Super Admin information
ko: 관리자는 슈퍼 관리자 정보를 삭제할 수 없습니다.

source: Super Admin cannot delete Super Admin information
ko: 슈퍼 관리자는 슈퍼 관리자를 삭제할 수 없습니다.

source: Admin cannot modify Super Admin, Admin information
ko: 관리자는 슈퍼 관리자, 관리자 정보를 수정할 수 없습니다.

source: Phone number must be 10 digits
ko: 전화번호는 10자리여야 합니다.

source: Admin or Super Admin not allowed to bid
ko: 관리자 또는 슈퍼 관리자는 입찰할 수 없습니다

source: Super Admin cannot modify Super Admin information
ko: 슈퍼 관리자는 슈퍼 관리자 정보를 수정할 수 없습니다
